import { CommonStateError } from '@/locales/types/common/state';

export default {
	login_link: 'Влез в акаунт.',
	contact_support_link: 'Свържи се с нас.',
	'400_title': 'Упс! Нещо се обърка.',
	'400_message': 'Сървърът не можа да разбере вашата заявка.',
	'400_tip': 'Проверете внимателно URL адреса или подадените данни.',
	'401_title': 'Нямате достъп до тази страница!',
	'401_message': 'Трябва да влезете, за да видите това съдържание.',
	'401_tip': 'Ако смятате, че това е грешка, свържете се с администратор.',
	'403_title': 'Забранен достъп!',
	'403_message': 'Нямате разрешение за достъп до този ресурс.',
	'403_tip':
		'Свържете се с администратор, ако смятате, че трябва да имате достъп.',
	'404_title': 'Страницата не е намерена!',
	'404_message': 'Не можахме да намерим страницата, която търсите.',
	'404_tip': 'Проверете URL адреса или се върнете на началната страница.',
	default_title: 'Нещо се обърка!',
	default_message: 'Възникна неочаквана грешка. Опитайте по-късно.',
	default_tip: 'Ако проблемът продължи, свържете се с нас.',
} satisfies CommonStateError;
